backend/__tests__/performance/load-testing.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./performance-processor.js"

scenarios:
  - name: "Complete user booking flow"
    flow:
      - post:
          url: "/api/auth/signup"
          json:
            username: "loadtest_{{ $randomString() }}"
            email: "loadtest{{ $randomNumber() }}@test.com"
            password: "testpass123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/rooms"
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            - json: "$[0].id"
              as: "roomId"
      - post:
          url: "/api/bookings"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            roomId: "{{ roomId }}"
            date: "2026-06-15"
            startTime: "{{ $randomString() }}"
            endTime: "{{ $randomString() }}"
      - get:
          url: "/api/bookings/my-bookings"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Room browsing"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "loadtest@example.com"
            password: "testpass123"
          capture:
            - json: "$.token"
              as: "authToken"
      - loop:
        - get:
            url: "/api/rooms"
            headers:
              Authorization: "Bearer {{ authToken }}"
        - think: 2
        count: 10