backend/__tests__/performance/quick-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 10
      arrivalRate: 3
      name: "Quick test"

scenarios:
  - name: "Simple Flow"
    flow:
      - post:
          url: "/api/auth/signup"
          json:
            username: "quicktest_{{ $randomString() }}"
            email: "quick_{{ $randomString() }}@example.com"
            password: "password123"
          capture:
            json: "$.token"
            as: "token"
            strict: false
      - get:
          url: "/api/rooms"
          headers:
            Authorization: "Bearer {{ token }}"
      - post:
          url: "/api/bookings"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            roomId: 1
            date: "2026-12-15"
            startTime: "10:00"
            endTime: "11:00"